api/app/controllers/posts_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @topic = Topic.find(params[:topic_id])

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("topic_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"
---
  def create
    @topic = Topic.find(params[:topic_id])
    @new_post = @topic.posts.build(post_params)
    # @post = Post.new(post_params)

    respond_to do |format|
      if @new_post.save

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
  def update
    @topic = Topic.find(params[:topic_id])
    # @post = @topic.posts.find(params[:id])
    puts "POSTSSSSSSSSSSSSSSS"

    respond_to do |format|
      if @post.update(post_params)

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ? AND "posts"."id" = ? LIMIT ?  [["topic_id", 1], ["id", 7], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]
---
  def destroy
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.find(params[:id])

    if @post.destroy