api/app/controllers/topics_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ? AND "posts"."id" = ? LIMIT ?  [["topic_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @posts = @topic.posts
    @topic = Topic.find(params[:id])

INSERT INTO "posts" ("topic_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["topic_id", 1], ["body", nil], ["created_at", "2023-11-04 13:24:02.128515"], ["updated_at", "2023-11-04 13:24:02.128515"]]
---
  def create_post
    @new_post = @topic.posts.build(post_params)

    if @new_post.save

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit_post
    @topic = Topic.find(params[:topic_id])

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update_post
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.find(params[:id])